template-scripts/templateService/data/script-template-temp1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://account.api.pse.aepona.com/">
  <soapenv:Header>22 2</soapenv:Header>
  <soapenv:Body>
    <acc:script-template>
      <!--Optional:-->
      <callContext>
        <!--Optional:-->
        <additionalContext>
          <!--Zero or more repetitions:-->
          <additionalContext>
            <!--Optional:-->
            <tag>1</tag>
            <!--Optional:-->
            <value>10</value>
          </additionalContext>
          <additionalContext>
            <value>30</value>
            <tag>3</tag>
          </additionalContext>
          <additionalContext>
            <value>40</value>
            <tag>4</tag>
          </additionalContext>
          <additionalContext>
            <tag>10</tag>
          </additionalContext>
        </additionalContext>
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
      </callContext>
      <!--Optional:-->
      <sourceAccount>
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <idInfo>
          <!--Zero or more repetitions:-->
          <idInfo>
            <!--Optional:-->
            <tag>3</tag>
            <!--Optional:-->
            <value>6</value>
          </idInfo>
          <idInfo>
            <value>7</value>
            <tag>3</tag>
          </idInfo>
          <idInfo>
            <value>8</value>
            <tag>4</tag>
          </idInfo>
          <idInfo>
            <tag>0</tag>
          </idInfo>
        </idInfo>
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
        <!--Optional:-->
      </sourceAccount>
      <!--Optional:-->
      <!--Optional:-->
      <!--Optional:-->
    </acc:script-template>
  </soapenv:Body>
</soapenv:Envelope>
